"""
运算符	            Python表达式	                    结果	                描述	            支持的数据类型
+	            [1, 2] + [3, 4]	                [1, 2, 3, 4]	        合并	            字符串、列表、元组
*	            ["Hi!"] * 4	           ['Hi!', 'Hi!', 'Hi!', 'Hi!']	    重复	                字符串、列表、元组
in	            3 in (1, 2, 3)	              True	                元素是否存在	    字符串、列表、元组、字典
not in	        4 not in (1, 2, 3)	            True	            元素是否不存在	 字符串、列表、元组、字典
> >= == < <=	(1, 2, 3) < (2, 2, 3)	            True	            元素比较	            字符串、列表、元组
注意

in 在对 字典 操作时，判断的是 字典的键
in 和 not in 被称为 成员运算符
"""

