"""
九九乘法表:
需求 输出 九九乘法表，格式如下：
1 * 1 = 1
1 * 2 = 2   2 * 2 = 4
1 * 3 = 3   2 * 3 = 6   3 * 3 = 9
1 * 4 = 4   2 * 4 = 8   3 * 4 = 12  4 * 4 = 16
1 * 5 = 5   2 * 5 = 10  3 * 5 = 15  4 * 5 = 20  5 * 5 = 25
1 * 6 = 6   2 * 6 = 12  3 * 6 = 18  4 * 6 = 24  5 * 6 = 30  6 * 6 = 36
1 * 7 = 7   2 * 7 = 14  3 * 7 = 21  4 * 7 = 28  5 * 7 = 35  6 * 7 = 42  7 * 7 = 49
1 * 8 = 8   2 * 8 = 16  3 * 8 = 24  4 * 8 = 32  5 * 8 = 40  6 * 8 = 48  7 * 8 = 56  8 * 8 = 64
1 * 9 = 9   2 * 9 = 18  3 * 9 = 27  4 * 9 = 36  5 * 9 = 45  6 * 9 = 54  7 * 9 = 63  8 * 9 = 72  9 * 9 = 81
"""
row = 1
col = 1

while row <= 9:
    # 阶梯式乘法口诀，判断i和j的大小，不重复输出
    while row >= col:
        # end("")表示输出后不换行，下一次输出在同一行
        # 增加转义字符，\t：在控制台输出一个 制表符，协助在输出文本时 垂直方向 保持对齐
        print("%d * %d =" % (col, row), row*col, end="\t")
        col += 1

    row += 1  # 将乘数的值递增
    col = 1  # 将被乘数的值重置

    # 直接输出print("")表示换行
    print("")
